# ElevSymbolId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElevSymbolId Property
ParameterTypeId Class See Also
---
"Elevation Mark"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElevSymbolId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElevSymbolId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElevSymbolId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace